#ifndef OUTPUT_H_
#define OUTPUT_H_

#include "struct.h"
#include "const.h"

//-------------------------------------------------------------------------------------------
//! Функция для вывода корней
//!
//! @param num_of_roots - количество корней
//! @param x1 - наименьший из двух корней
//! @param x2 - наибольший из двух корней
//!
//! @note Выводит корни в формате "x = "
//-------------------------------------------------------------------------------------------

void prnt_roots(int* num_of_roots, Roots* Roots);

#endif