#ifndef UNIT_TEST_H
#define UNIT_TEST_H

#include <stdio.h>
#include "struct.h"
#include "clear.h"

//-------------------------------------------------------------------------------------------
//! Функция для запуска тестов из файла
//-------------------------------------------------------------------------------------------

void TestsolveSquare(void);

//-------------------------------------------------------------------------------------------
//! Алгоритм выполнения теста
//! 
//! @param TestCoef - стуктура коэффициентов для теста
//! @param ExpectRoots - ожидаемые корни
//! @param ExpectNumRoots - ожидаемое колиество корней
//!
//! @par Принцип работы: 
//!     1. Функция получает корни и их количество из функции roots()
//!     2. Сравнивает полученные корни с ожидаемыми, полученное количество с ожидаемым
//!     
//! @return OK
//! @return В противном случае сообщение о соответствующей ошибке
//!
//-------------------------------------------------------------------------------------------

void test(Coefficients TestCoef, Roots ExpectRoots, int ExpectNumRoots);

int readTest(FILE *tests, Coefficients* TestCoef, Roots* TestRoots, int* NumRoots);

#endif