#ifndef SOLVE_H_
#define SOLVE_H_

#include "const.h"
#include "struct.h" 

//---------------------------------------------------------------------------------------
//! Главная функция, которая собирает в себе функции ввода, поиска корней и их вывода
//!
//! @return 0 - прерывает решение уравнения при неправильном вводе
//! @return 1 - возвращает при правильном вводе
//!
//---------------------------------------------------------------------------------------

int solveSquare(void);

//---------------------------------------------------------------------------------------
//! Решает линейное уравнение ax + b = 0
//! @param a, b - соответствующие коэффициенты уравнения типа double
//!
//! @warning Если a = 0 вызывает assert()
//!
//! @return Возвращает корень уравнения типа double
//!
//---------------------------------------------------------------------------------------

double solveLine(double a, double b);

//---------------------------------------------------------------------------------------
//! Функция занимается подсчетом корней
//!
//! @param Coef - структура с коэффициентами a, b, c
//! @param Roots - структура с корнми
//!
//! @return Количество корней: 0, 1, 2
//! @return ERR - если уравнению удовлетворяют все действительные числа
//!
//---------------------------------------------------------------------------------------

int roots(Coefficients *Coef, Roots *Roots);

//---------------------------------------------------------------------------------------
//! Сравнивает два числа с учетом погрешности 1e-10
//!
//! @param num1, num2 - два числа
//!
//! @return 1 - num1 > num2
//! @return 0 - num1 == num2
//! @return -1 - num1 < num2 
//!
//---------------------------------------------------------------------------------------

int comparison(double num1, double num2);

//---------------------------------------------------------------------------------------
//! Переставляет корни в порядке в возрастания
//!
//! @param x1, x2 - два числа типа double
//!
//---------------------------------------------------------------------------------------

void minax(double* x1, double* x2);

//---------------------------------------------------------------------------------------
//! 
//! @param a, b - два числа double
//! 
//! @return Минимальное из двух чисел
//!
//---------------------------------------------------------------------------------------

double min(double a, double b);

//---------------------------------------------------------------------------------------
//! 
//! @param a, b - два числа double
//! 
//! @return Максиимальное из двух чисел
//!
//---------------------------------------------------------------------------------------

double max(double a, double b);

#endif